play-telco-templates/src/test/resources/RolandExample1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   	<soap:Header />
   	<soap:Body>
   	    <wsnt:Notify xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
   	        <wsnt:NotificationMessage>
   	            <wsnt:Topic xmlns:s="http://streams.event-processing.org/ids/" Dialect="http://www.w3.org/TR/1999/REC-xpath-19991116">s:TaxiUCClic2call</wsnt:Topic>
   	            <wsnt:Message>
   	                <mt:nativeMessage xmlns:mt="http://www.event-processing.org/wsn/msgtype/" mt:syntax="application/x-trig">
						@prefix :        &lt;http://events.event-processing.org/types/&gt; .
						@prefix e:       &lt;http://events.event-processing.org/ids/&gt; .
						@prefix dsb:     &lt;http://www.petalslink.org/dsb/topicsns/&gt; .
						@prefix xsd:     &lt;http://www.w3.org/2001/XMLSchema#&gt; .
						@prefix uctelco: &lt;http://events.event-processing.org/uc/telco/&gt; .
						@prefix geo:     &lt;http://www.w3.org/2003/01/geo/wgs84_pos#&gt; .
						e:cl1-24 {
						e:cl1-24#event 
						uctelco:sequenceNumber "24"^^xsd:integer ;
						uctelco:uniqueId "taxiUC:cl1-24" ;
						uctelco:message "mess1" ;
						uctelco:callerPhoneNumber "33600000011" ;
						uctelco:calleePhoneNumber "33600000010" ;
						# but also some other data according to event format
						a :UCTelcoClic2Call ;
						:source &lt;http://sources.event-processing.org/ids/WSN-WS#source&gt; ;
						:stream &lt;http://streams.event-processing.org/ids/TaxiUCClic2Call#stream&gt; .
						
						}
					</mt:nativeMessage>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</soap:Body>
</soap:Envelope>
